class MsgCopy{
  static const String privacyContent ='''
欢迎注册小萌宠

我们仅为18岁以上的用户提供服务

在注册小萌宠前请务必审慎阅读小萌宠使用协议，充分理解协议中相关条款内容。一旦注册小萌宠，即视为已了解并同意该协议的各项内容。

《小萌宠使用协议》
为获得深圳市妙想智能科技有限公司（以下或简称“妙想”）提供的小萌宠APP服务（以下或简称“小萌宠”），请务必审慎阅读、充分理解本协议所有条款。一旦注册，则视为了解并完全接受本协议的全部内容，包括小萌宠对使用协议所做的任何修改。如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人的陪同下阅读和判断是否同意本协议，并特别注意“7、未成年人使用条款”。

1、接受条款

1.1 本协议约定妙想根据本条款及不时更新的规则为用户提供的服务。本协议可由妙想随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不另行通知。一旦注册、登录、使用本服务，即成为小萌宠的用户，并接受本协议的约束。

1.2 用户应遵守本协议的各项条款，合法使用小萌宠提供的服务，否则公司将有权中断或终止提供服务。

1.3 当用户使用小萌宠单项服务时，用户和小萌宠应遵守与该服务相关的规则。前述所有的规则，均构成本协议的一部分。

2、用户注册

2.1 用户在使用本服务前需注册“小萌宠”帐号。妙想可以根据用户需求或产品需要对帐号注册和绑定的方式进行变更。

2.2 为了能使用本服务，按照法律的要求，用户需同意以下事项：依本服务注册提示填写正确的注册邮箱、密码、名号、手机号码等信息，并确保今后更新的登录邮箱、名号、头像及手机号码等资料的真实性、有效性和合法性。若提供任何违法、不道德或小萌宠认为不适合展示的资料；小萌宠有理由怀疑该行为属于程序或恶意操作，有权无须事先通知即可暂停或终止使用账号，并拒绝于现在和未来使用本服务之全部或任何功能。

2.3 小萌宠无须对用户的任何注册或登记资料承担任何责任，包括但不限于鉴别、核实任何注册或登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。

3、用户账号和密码安全

3.1 完成本服务的注册程序并成功注册之后，用户可使用注册邮箱/手机号码和密码登录到其在小萌宠的账号。注册完成之时，便获得了账号的使用权。

3.2 用户应对所有使用账号的行为负完全的责任：

1）账号遭到未获授权的使用，或者发生其它任何安全问题时，需立即通知妙想；

2）如果未保管好自己的账号和密码，因此而产生的任何损失或损害，妙想不承担任何责任；

3）用户需对使用账号的行为给用户、妙想或第三方造成的损害负全责，包括未保管好自己账号或密码的情形。

4）用户同意在任何情况下不使用其他用户的帐号或密码。

5）用户同意不可利用技术手段批量建立虚假帐号；

3.3 “小萌宠”帐号的所有权归妙想所有，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。

3.4 用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，妙想在通知用户后有权依据协议中断或终止对违约用户帐号提供服务。同时，妙想保留在任何时候收回帐号、用户名的权利。

4、用户个人信息保护

4.1 保护用户个人信息安全既是法律要求，也是妙想长期坚持的一项基本原则。用户提供的注册资料及妙想保留的有关用户的其它资料将受到法律保护。妙想将根据法律、本协议、《小萌宠隐私协议》的规定收集、存储、使用个人信息。

4.2 用户可以通过APP中提示的操作来查询、更改、删除 “小萌宠”帐户上的个人资料、注册信息及传送内容等，但出于安全性和身份识别的考虑，可能无法修改注册时提供的性别等信息。此外，删除有关信息的同时也会删除用户储存在系统中的文字和图片，用户需承担该风险。

5、用户行为

5.1 用户应遵守相关法律法规，并同意对以任何方式使用登录账号而使用本服务的任何行为及其结果承担全部责任。如用户的行为违反国家法律，将依法承担全部法律责任；如涉嫌构成犯罪，司法机关将追究刑事责任，小萌宠将严格按照法律规定的义务及司法机关的要求进行配合。

5.2 用户承诺将不会利用“小萌宠”帐号或服务进行任何违法或不正当的活动，包括但不限于下列行为：

1）发布或以其他方式传送含有下列内容之一的信息：

· 反对宪法所确定的基本原则的；

· 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；

· 损害国家荣誉和利益的；

· 煽动民族仇恨、民族歧视，破坏民族团结的；

· 破坏国家宗教政策，宣扬邪教和封建迷信的；

· 散布谣言，扰乱社会秩序，破坏社会稳定的；

· 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；

· 侮辱或者诽谤他人，侵害他人合法权益的；

· 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其他道德上令人反感的内容；

· 含有法律、法规、（部门）规章以及任何具有法律效力之规范所限制或禁止的其他内容的；

· 含有妙想认为不适合在小萌宠上展示的内容；

· 侵害他人著作权、专利权、商标权、商业秘密、或其他专属权利的内容；

2）盗用他人头像或资料，冒充、利用他人名义，冒充其他任何人或机构；

3）以任何方式危害他人的合法权益；

4）强制、诱导其他用户关注、点击链接页面或分享信息的；

5）制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；

6）干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；

7）将设计目的在于干扰、破坏或限制任何计算机软件、硬件或通讯设备功能之计算机病毒（或其他计算机代码、档案和程序之任何资料，加以发布、发送或以其他方式传送；

8）其他违反法律法规规定、侵犯其他用户合法权益、干扰“小萌宠”正常运营或未明示授权的行为。

9）跟踪、人肉搜索或以其他方式骚扰他人；

10）故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；

5.3 用户通过本服务提供、发布或传送之内容、与本服务连线、违反本使用协议、或侵害他人任何权利因而衍生或导致任何第三人提出任何索赔或请求，包括但不限于合理的律师费、诉讼费，用户需赔偿妙想及其子公司、关联公司、高级职员、代理人、品牌共有人或其他合作伙伴及员工，并使其免受损害，并承担由此引发的全部法律责任。

5.4 用户不可对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其他商业目的。

6、用户专属权利

6.1 妙想尊重他人合法权益（包括知识产权、名誉权、商誉权等），呼吁用户也尊重他人合法权益。

6.2 如果用户违反法律法规的禁止性规定、对他人合法权益或公众利益造成了侵害，妙想将依国家法律法规的规定，或在适当的情形下，依本协议或其相关规定，删除特定内容或以至终止其对账户的使用。

7、未成年人条款

7.1 妙想的产品仅为成人提供服务，未成年人不得使用小萌宠APP、不得创建自己的账户，如用户不满18周岁，请立即停止注册及使用小萌宠所提供的全部服务。

7.2 尽管当地法律和习俗对未成年人的定义不同，但妙想将不满 18 周岁的任何人均视为未成年人。 

7.3 在小萌宠发现未成年人谎报年龄并注册使用的，用户有责任立即通知小萌宠；如果发现出现未成年人的账号和相关信息，妙想会设法尽快删除账号和相关数据。 

8、用户责任

8.1 如果妙想发现或收到他人举报或投诉用户违反本协议约定的，妙想有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规帐号处以包括但不限于警告、帐号封禁 、设备封禁 、功能封禁 的处罚，且通知用户处理结果。

8.2 因违反用户协议被封禁的用户，可向客服提交申诉，妙想将对申诉进行审查，并自行合理判断决定是否变更处罚措施。

8.3 用户理解并同意，妙想有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。

8.4 用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿妙想与合作公司、关联公司，并使之免受损害。

9、知识产权

9.1 妙想在本服务中提供的内容（包括但不限于程序代码、界面设计、版面框架、数据资料、账号、网页、文字、图片、音频、视频、图形、图表等）的知识产权均归妙想所有，但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。

9.2 除另有特别声明外，妙想提供本服务时所依托软件的著作权、专利权及其他知识产权均归妙想所有。

9.3 妙想在本服务中所涉及的图形、文字或其组成，以及其他妙想标志及产品、服务名称（以下统称“妙想公司标识”），其著作权或商标权归妙想所有。未经妙想事先书面同意，用户不得将妙想公司标识以任何方式展示、使用或作其他处理，也不得向他人表明用户有权展示、使用、或其他有权处理妙想公司标识的行为。

9.4 用户在小萌宠上传或发布的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益，用户同意授予妙想对上述内容免费、不可撤销的、无期限限制的、再许可或转让的使用权许可，据该许可妙想将有权以展示、推广及其他不为法律所禁止的方式使用前述内容。

9.5 如违反世界版权公约、著作权法、商标法、专利法、反不正当竞争法及其他与知识产权方面相关的法律法规或本协议约定，用户应自行承担因此而给他人（包括妙想）造成的损害，承担相应的法律责任。

10、免责事由

10.1 根据有关法律法规，妙想在此郑重声明，任何经由本服务而发布上传的文字、声音、图片、图形、或其他资料（以下简称“内容 ”），无论系公开还是非公开传送，均由内容提供者承担责任，如因此给妙想或第三方造成损害的，用户应当依法予以赔偿。

10.2 用户理解并同意，用户必须为自己注册帐号下的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。任何经由本服务而发布上传的文字、照片、或其它资料（以下简称“内容 ”），无论系公开还是私下传送，均由内容提供者承担责任。妙想仅为用户提供内容存储空间，无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性或品质。用户应对“小萌宠”及本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险。妙想无法且不会对因用户行为而导致的任何损失或损害承担责任。但妙想有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。

10.3 用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，妙想不承担任何责任。

10.4 用户理解并确认，妙想需要定期或不定期地对“小萌宠”平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，妙想无需为此承担任何责任，但应事先进行通告。

10.5 依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成妙想的义务或承诺，妙想不能保证及时发现违法违规或违约行为或进行相应处理。

10.6 用户理解并确认，对于向用户提供的下列产品或者服务的质量缺陷及其引发的任何损失，妙想无需承担任何责任：

1) 向用户免费提供的服务；

2) 向用户赠送的任何产品或者服务。

10.7 用户理解并同意，因业务发展需要，妙想保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。

11、服务变更、中断、终止

11.1 妙想可能会对服务内容进行变更、也可能会中断、终止服务。

11.2 鉴于网络服务的特殊性，用户同意妙想有权随时变更、中断或终止部分或全部的服务（包括收费服务）。但应当在变更、中断或终止之前通知用户，并应向受影响的用户提供等值的替代性的服务。

11.3 如发生下列任何一种情形，妙想有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：

1) 根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；

2) 用户违反相关法律法规或本协议的约定；

3) 按照法律规定或有权机关的要求；

4) 出于安全的原因或其他必要的情形。

12、不可抗力

12.1 用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，妙想及合作单位在法律允许的范围内免责。

12.2 本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。

12.3 用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，妙想不承担任何责任。

13、一般条款

13.1 小萌宠公布的《小萌宠APP用户使用规范》、《小萌宠APP妙想社区规范》均是本协议的有效组成部分，本协议及与小萌宠服务相关规则共同规范用户对于本服务之使用行为。在使用相关服务、使用第三方提供的内容或软件时，亦应遵从所适用之附加条款及条件。

13.2 本协议的效力、解释及纠纷的解决，适用于当地法律法规。若用户和妙想之间发生纠纷或争议，首先应友好协商解决，协商不成时可提请妙想实际运营者所在地有管辖权的人民法院通过诉讼解决。

13.3 本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。

13.4 妙想未行使或执行本使用协议任何权利或规定，不构成对前述权利或权利之放弃。
13.5 妙想对本协议享有最终解释权。
''';
  static const String agreeContent ='''
本政策仅适用于深圳市妙想智能科技有限公司的小萌宠APP产品及相关服务。
最近更新日期:2024年3月26日
即刻生效日期:2024年3月26日
如您对本政策或相关事宜有任何疑问、意见或建议，您可以通过以下联系方式或平台提供的其他各种联系方式与我们取得联系:
个人信息保护负责人邮箱：gd.sun@cxw-chip.com

本隐私保护政策将帮助您了解以下内容:
1、我们如何收集和使用您的个人信息
2、我们如何委托处理、共享、转让、公开披露您的个人信息
3、我们如何保护您的个人信息
4、您的权利
5、我们如何处理未成年人的个人信息
6、我们如何存储您的个人信息
7、隐私政策的修订和通知
8、如何联系我们
9、适用范围

深圳市妙想智能有限公司（以下简称“我们”）深知个人信息对您的重要性，我们将按照法律法规的规定，全力保护您的个人信息及隐私安全。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则，目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等等。同时我们承诺，我们将按照业界成熟的安全解决方案，采取相应的安全保护措施来保护您的个人信息。
希望您在使用我们旗下产品及相关服务前，仔细阅读，透彻理解，本隐私保护政策，以便做出适当的选择。一旦开始使用我们产品和相关服务，即表示您已充分理解并同意本隐私保护政策。本隐私协议仅适用于深圳市妙想智能有限公司旗下产品和相关服务所收集的信息，不适用于通过我们而接入的第三方服务收集的信息。我们会严格筛查并选用符合相关法律法规规定隐私保护政策的第三方服务。

引言
我们对其收集的用户信息严格保密，并建立健全用户信息保护制度，以便为每一位用户提供可靠、放心的服务：
1、清晰明确
我们将尽可能采用通俗易懂的文字为您阐释隐私政策，以便您能更清晰地了解我们如何保护和处理所收集的您的信息。
2、保障权益
我们将采取充分、合理的措施保障您的隐私权益。
3、尊重用户
我们尊重用户的选择权、知情权等权利的自由行使，允许您管理您的个人信息。
4、必要安全
我们将仅收取必要的信息，并利用这些信息为您提供安全、详实的服务。
5、及时贴心
我们将随时聆听您的询问，并尽快为您解答您的疑问。
希望您仔细阅读《隐私保护政策》（以下简称“本政策”），详细了解我们对信息的收集、使用方式，以便您更好地了解我们的服务并在是否选择服务以及选择何种服务时更加符合您的真实意图表示。如您有问题，请联系我们。
一、我们如何收集使用您的个人信息
个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。
为给您带来更好的产品和服务体验,我们在持续努力改进我们的技术,随之我们可能会不时推出新的或优化后的功能，可能需要收集、使用新的个人信息或变更个人信息使用目的或方式。对此，我们将通过包括但不限于更新本政策、页面提示的方式另行向您说明对应信息的收集目的、范围及使用方式,并为您提供自主选择同意的方式,且在征得您明示同意后收集、使用。在此过程中,如果您有任何疑问、意见或建议的，您可通过我们提供的各种联系方式与我们联系,我们会尽快为您作出解答。
我们收集的个人信息类型,以及收集、使用个人信息的规则如下:
(一)注册、登录
当您注册平台及相关服务时,我们会收集您的手机号码、 Android ID、IMSI、IMEI、OAID、Mac地址、IP地址、拟使用的用户名和密码用于创建平台帐户。如您选择通过第三方帐户直接登录,我们会根据您的授权从第三方处获取您的第三方帐户信息(包括但不限于昵称、头像、性别），并与您的平台帐户进行绑定,使您可通过第三方帐户直接登录、使用我们的产品或服务，我们将在您授权同意的范围内使用您的相关信息。在注册与使用服务过程中,如果您提供以下额外信息补全个人资料，将有助于我们给您提供更好的服务和体验，包含：性别、出生日期、星座、所在地。您提供的上述信息将在您使用本服务期间持续授权我们使用。在您主动注销帐号时，我们将根据适用法律法规的要求尽快使其匿名或删除您的个人信息。
(二)为您展示和推送内容或服务
为改善我们的产品或服务、向您提供精准的信息搜索及相关服务，我们会收集相关必要的日志信息，主要包括：
您操作、使用的行为信息:点击、关注、搜索、浏览；
您主动提供的信息:反馈、发布、点赞、评论。
(三)为您提供信息发布与互动服务
1. 您发布图片內容或进行评论时，我们将收集您发布的信息,并展示您的昵称、头像、发布内容和信息。
2. 您使用发布图片功能时，我们会请求您授权相机、照片、麦克风、查看网络状态权限。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用其他功能。
3. 当您选择与您感兴趣的人建立关注关系时，我们会收集包括您的关注关系、分享历史在内的服务日志信息用于实现上述功能及其他我们明确告知的目的。
(四)为提供安全保障功能目的
为向您提供更安全、可信的产品与使用环境，提供优质、可靠的服务与信息，我们会收集关于您使用的产品或服务以及使用方式的信息并将这些信息进行关联，这些信息包括：
设备信息
当您在使用平台的过程中，为向您提供更符合您需求的服务、交互展示、搜索结果、识别账号异常状态，维护平台正常运行，并保障您的账号安全，我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息(包括设备型号、硬件序列号、操作系统版本、设置参数、设备配置、国际移动设备识别码（IMSI）、唯一设备标识符（IMEI、OAID、AndroidID）、网络设备硬件地址（MAC地址）、设备网络信息、设备环境软硬件特征信息、WLAN接入点、蓝牙、基站、接入网络的方式、类型和状态、网络质量数据。设备所在位置相关信息(IP地址、地理位置信息),因我们提供的服务系基于地理位置提供的移动社交服务，您确认成功注册“平台"帐号视为确认授权我们提取、公开及使用您的IP地址信息。
2.日志信息
当您使用我们的网站或客户端提供的产品或服务时,我们会自动收集您对我们产品或服务的详细使用情况，作为有关网络日志保存。包括您的浏览、点击查看和搜索查询内容、关注分享信息、发布信息,以及IP地址、浏览器的类型、运营商信息、使用的语言、访问日期和时间及您访问的网页记录。请注意，单独的设备信息、日志信息是无法识别特定自然人身份的信息，故单独的设备信息、日志信息非本政策所指“个人信息"。如果我们将这类信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用,则在结合使用期间,这类信息将被视为个人信息，除取得您授权或法律法规另有规定外,我们会将该类个人信息做匿名化、去标识化处理。为向您提供更便捷、更符合您个人需求的信息展示及推送服务，我们会根据您的设备信息和服务日志信息,提取您的偏好特征，并基于特征标签产岀间接人群画像,用于展示、推送信息。
当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式，以便与您联系或帮助您解决问题，也可能会记录相关问题的处理方案及结果。
为提高您使用我们及关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害,更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或平台相关协议规则的情况，我们可能使用或整合您的用户信息、交易信息、设备信息、有关网络日志以及关联公司、合作伙伴取得您授权或依据法律共享的信息，进而综合判断您帐户的交易风险、进行身份验证、检测及防范安全事件，并依法釆取必要的记录、审计、分析、处置措施。
请您了解,随着我们业务的发展，可能会对“平台"的功能和提供的服务有所调整。原则上，当新功能或新服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知,并征得您的同意。
(五)其他用途
1. 若您提供的信息中含有其他用户的个人信息，在向平台提供这些个人信息之前，您需确保您已经取得合法的授权。
2. 若我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，或者我们主动从第三方处获取您的个人信息，均会事先获得您的同意。
3. 若我们从第三方处间接获取您的信息的，我们会在收集前明确以书面形式要求该第三方在已依法取得您同意后进行收集，并向您告知共享的信息內容，且涉及敏感信息的在提供给我们使用前需经过您的明确确认，要求第三方对个人信息来源的合法性和合规性作出承诺，如第三方有违反行为的，我们会明确要求对方承担相应法律责任；同时，我们的专业安全团队对个人信息会进行安全防护(包括敏感信息分级分类、敏感信息使用的访问控制、敏感信息加密存储等)。我们会使用不低于我们对自身用户个人信息同等的保护手段与措施对间接获取的个人信息进行保护。
4. 我们可能将通过某些功能所收集的信息用于我们的其他服务。包含：我们将您在使用我们某一功能或服务时所收集的信息用于可能向您提供的另一功能或服务，包括展示广告、对您阅读过的內容进行信息安全类提示、基于特征标签进行间接人群画像并提供更加精准的服务和内容。如我们使用您的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的明示同意。
5. 平台APP设备权限调用说明:
读取电话状态权限：当您运行安卓版平台APP时，我们会向您申请获取此权限，目的是方便拨打客服，如您拒绝您可选择关闭此权限。
读写外部存储权限：当您使用安卓版平台APP中的头像设置、发送图片，您可以通过开启存储权限使用或保存图片或文件。若您不开启此权限，您将无法使用与存储卡读取或缓存相关的功能，但不影响您使用其他服务。
相册权限：当您使用安卓或iOS版本平台APP中的头像设置、发送图片时，您可以通过开通相册权限，以便上传设备中的图片。若您不开启此权限，您将无法使用图片上传、发送图片相关的功能，但不影响您使用其他服务。
相机权限:当您使用安卓或iOS版本平台APP中的头像设置、发送图片时，您可以通过开通相机权限，以便进行实时拍摄,并上传图片进行晒设置头像、发送图片。若您不开启此权限，您将无法使用图片拍摄相关的功能，但不影响您使用其他服务。
位置权限:当您使用安卓或iOS版本平台APP中的远程遥控功能时，您可以通过开启位置权限, 给您提供查看远程遥控双方大致距离的功能。您不开启此权限，您将无法使用该功能，但不影响您使用其他服务。
位置权限：当您使用安卓版本平台APP时，我们将获取该权限使应用连接小萌宠设备，给您提供APP直接控制设备的功能。您不开启此权限，您将无法使用该功能，但不影响您使用其他服务。
麦克风权限：当您使用安卓或iOS版本平台APP中的语音服务时，您可以开启麦克风权限，录制个人资料语音条、发送语音消息或进行语音通话。若您不开启此权限，您将无法使用语音输入相关的功能，但不影响您使用其他服务。
蓝牙权限：当您使用安卓或iOS版本平台APP时，我们将获取该权限使应用连接小萌宠设备，给您提供APP直接控制设备的功能。您不开启此权限，您将无法使用该功能，但不影响您使用其他服务。
查看网络状态权限：当您使用安卓或iOS版本平台APP时，我们将获取此权限用于查看所有网络状态，例如存在和连接的网络。若您不开启此权限，您将无法及时获取网络状态变化的提示，但不影响您使用其他服务。
您理解并同意，上述服务可能需要您在您的设备中开启您的位置信息 （地理位置）、摄像头（相机）、相册及存储、麦克风（语音）、电话状态、网络状态的访问权限，以实现这些权限所涉及信息的收集和使用。您可在您的设备的 “设置-应用权限”中查看上述权限的状态，并可自行决定这些权限随时的开启或关闭。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。
您理解并同意，我们向您提供的功能和服务场景是不断升级的，如我们未在上述场景中明示您需要收集的个人信息，我们将会通过页面提示、交互设计等方式另行向您明示信息收集的内容、范围和目的并征得您同意。

安卓操作系统应用权限申请和使用说明
为保障小萌宠能实现安全稳定运行之目的，我们可能会申请或使用安卓系统的相关权限:为保障您的知情权，我们通过下列内容将产品可能申请、使用的相关操作系统权限进行展示说明，您可以根据实际需要的相关权限进行管理：
1. 访问网络
android.permission.INTERNET
• 权限功能说明: 访问网络连接,可能产生GPRS流量。
2. 录音
android.permission.RECORD_AUDIO
• 权限功能说明: 录制声音通过手机或耳机的麦克。
3. 获取网络状态
android.permission.ACCESS_NETWORK_STATE
• 权限功能说明: 获取网络信息状态,如当前的网络连接是否有效。
4. 获取Wi-Fi状态
android.permission.ACCESS_WIFI_STATE
• 权限功能说明: 获取当前Wi-Fi接入的状态以及WLAN热点的信息。
5. 改变Wi-Fi状态
android.permission.CHANGE_WIFI_STATE
• 权限功能说明: 改变Wi-Fi状态。
6. 唤醒锁定
android.permission.WAKE_LOCK
• 权限功能说明: 允许程序在手机屏幕关闭后后台进程仍然运行。
7. 修改声音设置
android.permission.MODIFY_AUDIO_SETTINGS
• 权限功能说明: 修改声音设置信息。
8. 开机自动允许
android.permission.RECEIVE_BOOT_COMPLETED
• 权限功能说明: 允许程序开机自动运行。
9. 写入外部存储
android.permission.WRITE_EXTERNAL_STORAGE
• 权限功能说明: 允许程序写入外部存储,如SD卡上写文件。
10. 使用振动
android.permission.VIBRATE
• 权限功能说明: 允许振动。
11. 拨打电话
android.permission.CALL_PHONE
• 权限功能说明: 允许程序从非系统拨号器里输入电话号码。
12. 拍照权限
android.permission.CAMERA
• 权限功能说明: 允许访问摄像头进行拍照。
13. 使用蓝牙
android.permission.BLUETOOTH
• 权限功能说明: 允许程序连接配对过的蓝牙设备。
14. 蓝牙管理
android.permission.BLUETOOTH_ADMIN
• 权限功能说明: 允许程序进行发现和配对新的蓝牙设备。
15. 获取精确位置
android.permission.ACCESS_FINE_LOCATION
• 权限功能说明: 通过GPS芯片接收卫星的定位信息，定位精度达10米以内。
16. 获取任务信息
android.permission.GET_TASKS
• 权限功能说明: 允许程序获取当前或最近运行的应用。
iOS操作系统应用权限申请和使用说明
为保障小萌宠能实现安全稳定运行之目的，我们可能会申请或使用iOS系统的相关权限：为保障您的知情权，我们通过下述内容将产品可能申请、使用的相关操作系统权限进行展示说明，您可以根据实际需要的相关权限进行管理:
1. NSBluetoothAlwaysUsageDescription
• 权限功能说明: 使用蓝牙功能连接蓝牙设备。
2. NSBluetoothPeripheralUsageDescription
• 权限功能说明: 使用蓝牙功能连接蓝牙设备（兼容iOS 13以前的版本)。
3. NSCameraUsageDescription
• 权限功能说明: 使用摄像头。
4. NSLocationAlwaysUsageDescription
• 权限功能说明: 允许APP一直获取地理位置。
5. NSLocationUsageDescription
• 权限功能说明: 允许APP获取地理位置。
6. NSLocationWhenInUseUsageDescription
• 权限功能说明: 仅APP被使用时获取地理位置。
7. NSMicrophoneUsageDescription
• 权限功能说明: 使用麦克风。
8. NSPhotoLibraryAddUsageDescription
• 权限功能说明: 向相册中添加内容。
9. NSPhotoLibraryUsageDescription
• 权限功能说明: 读取相册中的内容。
征得授权同意的例外
您充分理解并同意,我们在以下情况下收集、使用您的个人信息无需您的授权同意，且我们可能不会同意您提出的更正/修改、删除、注销、撤回同意、索取信息的请求。
与国家安全、国防安全有关的；
与公共安全、公共卫生、重大公共利益有关的；
与犯罪侦查、起诉、审判和判决执行等有关的；
出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
所收集的个人信息是您自行向社会公众公开的；
从合法公开披露的信息中收集个人信息的,如合法的新闻报道、政府信息公开等渠道；
根据您的要求签订合同所必需的；
用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
为合法的新规报道所必需的；
学术研究机构基于公共利益开展统计或学术硏究所必要，且对外提供学术硏究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
法律法规规定的其他情形。
请知悉，根据适用的法律，若我们对个人信息釆取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，或我们可能会对收集的信息进行去标识化地研究、统计分析和预测，用于改善平台的內容和布局，为商业决策提供产品或服务支撑，以及改进我们的产品和服务(包括使用匿名数据进行机器学习或模型算法训练)，则此类处理后数据的使用无需另行向您通知并征得您的同意。
如我们停止运营平台产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。
二、我们如何委托处理、共享、转让、公开披露您的个人信息
（一)委托处理
平台某些具体的模块或功能由外部供应商提供。对我们委托处理个人信息的公司、组织或个人，我们会要求他们按照我们的要求、本个人信息保护政策以及其他任何相关的保密和安全措施来处理您的个人信息。
（二)共享
我们不会与平台服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：
在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。
在公司内共享：为便于公司共同向您提供服务、提供您可能感兴趣的信息、个别帐号异常、保护公司或其他用户、公众的人身财产安全免遭侵害，您的个人信息可能会在公司内共享。我们只会共享必要的个人信息，包含：为便于您使用平台帐号或使用公司内的产品及服务，我们会在公司内共享您必要的帐户信息。该类信息会受本隐私政策中所声明目的的约束，如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。
与授权合作伙伴共享：我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会出于本隐私权政策声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且不得将此信息用于其他任何目的。
在获取明确同意的情况下共享您提供的个人信息：为了将活动礼品送到您的手中，我们会将您填写的手机号、收件人姓名、收件地址共享给物流合作方。
目前，我们的授权合作伙伴包括以下类型：
广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息与提供广告、分析服务的合作伙伴共享。我们会委托这些合作伙伴处理与广告覆盖面和有效性相关的信息，但不会提供您的个人身份信息，或者我们将这些信息进行去标识化处理，以便它不会识别您个人。这类合作伙伴可能将上述信息与他们合法获取的其他数据相结合，以执行我们委托的广告服务或决策建议：
①广告共享的个人信息类型：昵称、头像。
②分析类服务商共享的个人信息类型：性别、年龄、所在地。
我们会对授权合作伙伴获取有关信息的应用程序接口(AP)、软件工具开发包(SDK)进行严格的安全检测，并与授权合作伙伴约定严格的数据保护措施，令其按照我们的委托目的、服务说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。
(三)转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
在涉及合并、收购或破产清算情形或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。
(四)公开披露
我们仅会在以下情况下，公开披露您的个人信息：
获得您明确同意或授权后；
如果我们确定您岀现违反法律法规或严重违平台聊相关协议规则的情况，或为保护平台及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或平台相关协议规则征得您同意的情况下披露您的个人信息，包括相关违规行为以及平台已对您釆取的措施。
(五)共享、转让、公开披露个人信息时事先征得授权同意的例外
以下情形中,共享、转让、公开披露您的个人信息无需事先征得您的授权同意。
与国家安全、国防安全有关的；
与公共安全、公共卫生、重大公共利益有关的；
与犯罪侦查、起诉、审判和判决执行等有关的；
出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的;；
您自行向社会公众公开的个人信息；
从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
根据法律规定，若我们对个人信息釆取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。
三、我们如何保护您的个人信息
(一)我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会釆取一切合理可行的措施，保护您的个人信息。
1. 我们将使用不低于行业同行的加密技术、匿名化处理及相关合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。
2. 我们将建立专门的安全部门、安全管理制度、数据安全流程保障您的个人信息安全。我们釆取严格的数据使用和访问制度，确保只有授权人员才可访问您的个人信息。 
3. 尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。
4. 您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括使用复杂密码、定期修改密码、不将自己的帐号密码及相关个人信息透露给他人。
5. 我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止这些安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失）后，我们将按照法律法规的要求，及时向您告知: 安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施。我们将及时将事件相关情况以推送通知、邮件、信函、短信及相关形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
（二)我们的数据安全能力
1. 内容安全：通过购买第三方的服务，包含: 腾讯云等来提高我们的內容安全存储和保护能力；
2. 数据安全：采用了腾讯云服务，在腾讯云提供的基本数据安全服务基础上，我们额外购买安全管家、漏洞扫描等多项安全服务用于确保用户个人信息安全。同时，对于用户隐私数据，我们使用国际标准加密方式进行加密存储，进一步保证数据安全存储。
3. 访问安全：所有请求采用HTTPS进行传输，在业务同时增加授权访问机制以保证访问的安全和稳定。
(三) 我们会釆取一切合理可行的措施，确保不会收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
(四) 互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
(五) 如您发现自己的个人信息尤其是您的帐户或密码发生泄露，请您立即联络平台客服，以便我们根据您的申请采取相应措施。
四、您的权利
按照中国相关的法律、法规、标准的通行做法，我们保障您对自己的个人信息行使以下权利：
访问您的个人信息
您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，您可以通过以下方式自行访问：
个人资料一一如果您希望访问或编辑您个人资料中的昵称、星座、年龄、地址，您可以在登录帐户后通过个人主页中的“基本资料“执行此类操作。
动态信息一一您可以在登录帐户后通过“萌宠圈”访问或清除您的动态发表历史记录。
如果您无法通过上述路径访问您的个人信息，您可以随时通过平台客服与我们取得联系。我们将尽快审核所涉问题，并由专人验证您的用户身份后在15个工作日予以回复您的访问请求。
更正您的个人信息
当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过本条“(一) 访问您的个人信息”中列明的方式提出更正申请。
如果您无法通过上述路径访问您的个人信息，您可以随时通过平台客服与我们取得联系。我们将尽快审核所涉问题，并由专人验证您的用户身份后在15个工作日予以回复您的访问请求。
删除您的个人信息
您可以通过本条“(一) 访问您的个人信息”中列明的方式删除您的部分个人信息。在以下情形中，您可以向我们提出删除个人信息的请求：
如果我们处理个人信息的行为违反法律法规；
如果我们收集、使用您的个人信息,却未征得您的明确同意；
如果我们处理个人信息的行为严重违反了与您的约定；
如果您不再使用我们的产品或服务,或您主动注销了帐户；
如果我们不再为您提供产品或服务。

若我们决定响应您的删除请求，我们还将同时通知从我们处获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
当您从我们的产品或服务中删除您的个人信息后，按照法律法规的要求我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。
改变您授权同意的范围
您可以在设备本身操作系统中关闭GPS地理位置、摄像头、麦克风、相册权限，改变同意范围或撤回您的授权。撤回授权后我们将不再收集与这些权限相关的信息。您同样可通过注销帐号的方式撤回授权。
特定的业务功能和服务将需要您的信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的功能和服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响我们此前基于您的授权而开展的个人信息处理。
个人信息主体注销帐户
您可以点击软件顶部【我的头像】-【客服】-【软件答疑解惑】-【注销账号】进行注销，在您注销帐号前，我们将验证您的个人身份、安全状态、设备信息。有关注销的流程和内容，请参见注销页面的提示。您知悉并理解，注销帐号的行为是不可逆的行为，当您注销帐号后，我们将删除有关您的相关信息或进行匿名化处理，但法律法规另有规定的除外。
个人信息主体获取个人信息副本
您有权获取您的个人信息副本。如您需要获取我们收集的您的个人信息副本，您可以联系我们，人工客服会对您进行个人信息校验，个人信息主体确认后将个人信息副本通过在线客服提交给您，在符合相关法律规定且技术可行的前提下,我们将根据您的要求向您提供您的个人信息副本。
约束信息系统自动决策
在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作岀解释，我们也将提供适当的救济方式。
投诉举报
如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您点击软件顶部【我的头像】-【客服】进入相关界面提交相关资料。我们会在15个工作日內核查并处理您的投诉与举报，如您对结果不满意，还可以通过平台客服发起投诉。对于某些无端重复、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。在以下情形中，按照法律法规要求，我们将无法响应您的请求：
与个人信息控制者履行法律法规规定的义务相关的；
与国家安全、国防安全直接相关的；
与公共安全、公共卫生、重大公共利益直接相关的；
与刑事侦查、起诉、审判和执行判决等直接相关的；
个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的；
出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的；
涉及商业秘密的。
五、我们如何处理未成年人的个人信息
我们的产品、网站和服务面向18岁以上成年人。任何不满18周岁的未成年人均不得创建自己的用户帐户及/或使用我们的服务。如我们发现或审核出任何未成年人注册或使用我们产品，我们将采取注销帐户、删除信息等措施禁止、限制未成年人的使用。
六、我们如何存储您的个人信息
(一) 我们依照法律法规的规定，将在境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前,我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循相关国家规定或者征求您的同意。
(二) 我们仅在为提供“平台”及服务之目的所必需的期间内保留您的个人信息：
您的个人信息在您未撤回、删除或未注销帐号期，,我们会保留相关信息。超出必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。
我们对您的手机号码之类的个人敏感信息采用了加密存储的方式以更好地保护您的个人敏感信息。
七、隐私保护政策的修订和通知
为了给您提供更好的服务，平台及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，这些修订构成本隐私保护政策的一部分并具有等同于本隐私政策的效力，未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。
本隐私保护政策更新后，我们会在平台发出更新版本，并以适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。
对于重大变更，我们还会提供更为显著的通知(包括对于某些服务,我们会通过电子邮件发送通知，说明个人信息保护政策的具体变更内容)。
本政策所指的重大变更包括但不限于:
我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等。
个人信息共享、转让或公开披露的主要对象发生变化。
您参与个人信息处理方面的权利及其行使方式发生重大变化。
我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。
个人信息安全影响评估报告表明存在高风险时。
八、如何联系我们
如您对本政策或相关事宜有疑问或建议等，我们建立了个人信息保护专职部门，您可以通过如下投诉渠道与我们取得联系:
个人信息保护负责人邮箱: gd.sun@cxw-chip.com
我们将妥善受理并及时反馈您的申诉，并在验证您的用户身份后的15个工作日内予以回复。
如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼来寻求解决方案。
九、适用范围
妙想提供的所有服务均使用本隐私政策。但是，请您注意，本隐私政策不适用由其他公司或个人提供的服务，且该服务适用其他公司或个人的隐私政策。
''';
}