class ActionMsg {

}

// 助机获取医保信息 <action></action>
// MES0001 自助机就诊卡查询
// MES0002 自助机发卡
// MES0003 自助机补卡
// MES0004 自助机获取患者基本信息
// MES0005 自助机挂号锁号和取消锁号
// MES0006 自助机获取医保信息
// MES0007 自助机挂号-提前挂号
// MES0008 自助机查询挂号记录
// MES0009 自助机退号
// MES0010 自助机停诊医生信息查询
// MES0011 自助机预约挂号状态回查接口
// MES0012 自助机挂号条打印接口
// MES0013 自助机预约
// MES0014 自助机查询患者预约记录
// MES0015 自助机病人取号确认
// MES0016 自助机取消预约
// MES0017 自助机根据关键字获取二级科室
// MES0018 自助机根据卡号及日期查询就诊记录
// MES0019 自助机获取病人就诊的医嘱信息
// MES0020 自助机结算并保存交易信息
// MES0021 自助机已缴费记录查询
// MES0022 自助机已缴费记录明细查询
// MES0023 自助机通过卡号获取患者基本信息和院内账户信息
// MES0024 自助机院内账户预交金充值
// MES0025 自助机通过卡号获取患者基本信息和住院记录
// MES0026 自助机住院预交金充值
// MES0027 自助机预交金查询
// MES0028 自助机住院费用每日清单查询
// MES0029 自助机住院费用汇总查询
// MES0030 自助机住院费用分类明细查询
// MES0031 自助机查询药品价格
// MES0032 自助机查询非药品收费项目价格
// ------ new added ------
// MES0033 查詢醫生排班信息
// MES0034 查詢醫生分時信息以及號源
